In [1]:
# Import Libraries
import pandas as pd
import numpy as np

In [2]:
# Read csv files
mspmandi = pd.read_csv('CMO_MSP_Mandi.csv')
monthlydata = pd.read_csv('Monthly_data_cmo.csv')

In [3]:
# Read the first 5 rows of mspmandi
mspmandi.head()

         commodity  year          Type  msprice  msp_filter
0   PADDY-UNHUSKED  2012  Kharif Crops   1250.0           1
1  RICE(PADDY-HUS)  2012  Kharif Crops   1280.0           1
2     Jowar_Hybrid  2012  Kharif Crops   1500.0           1
3    SORGUM(JAWAR)  2012  Kharif Crops   1520.0           1
4            BAJRI  2012  Kharif Crops   1175.0           1

In [4]:
# Read the first 5 rows of monthlydata
monthlydata.head()

,APMC,Commodity,Year,Month,arrivals_in_qtl,min_price,max_price,modal_price,date,district_name,state_name
0,Ahmednagar,Bajri,2015,April,79,1406,1538,1463,2015-04,Ahmadnagar,Maharashtra
1,Ahmednagar,Bajri,2016,April,106,1788,1925,1875,2016-04,Ahmadnagar,Maharashtra
2,Ahmednagar,Wheat(Husked),2015,April,1253,1572,1890,1731,2015-04,Ahmadnagar,Maharashtra
3,Ahmednagar,Wheat(Husked),2016,April,387,1750,2220,1999,2016-04,Ahmadnagar,Maharashtra
4,Ahmednagar,Sorgum(Jawar),2015,April,3825,1600,2200,1900,2015-04,Ahmadnagar,Maharashtra

In [5]:
# Find the columns of mspmandi
mspmandi.columns

Index(['commodity', 'year', 'Type', 'msprice', 'msp_filter'], dtype='object')

In [6]:
# Find information regarding the dataset
mspmandi.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 155 entries, 0 to 154
Data columns (total 5 columns):
commodity     155 non-null object
year          155 non-null int64
Type          155 non-null object
msprice       145 non-null float64
msp_filter    155 non-null int64
dtypes: float64(1), int64(2), object(2)
memory usage: 6.1+ KB

In [7]:
# Check if all the 155 msprice values are not null or null. On close introspection, we observe that there are some values which return true i.e. they are null.
mspmandi.isnull().sum()

commodity      0
year           0
Type           0
msprice       10
msp_filter     0
dtype: int64

In [8]:
# Fill the null values of most of the columns
mspmandi['msprice'] = mspmandi['msprice'].fillna(method = 'ffill')

In [9]:
mspmandi.isnull().sum()

commodity     0
year          0
Type          0
msprice       0
msp_filter    0
dtype: int64

In [10]:
# Check the values of last 5 rows of mspmandi
mspmandi.tail()

                  commodity  year         Type  msprice  msp_filter
150  Copra (Milling)_Yellow  2016  Other Crops   5950.0           1
151     Copra (Ball)_Yellow  2016  Other Crops   6240.0           1
152                 COCONUT  2016  Other Crops   1600.0           1
153             Jute_Yellow  2016  Other Crops   3200.0           1
154               SUGARCANE  2016  Other Crops    230.0           1

In [11]:
# Find the columns of monthlydata
monthlydata.columns

Index(['APMC', 'Commodity', 'Year', 'Month', 'arrivals_in_qtl', 'min_price',
       'max_price', 'modal_price', 'date', 'district_name', 'state_name'],
      dtype='object')

In [12]:
# Find information regarding the dataset monthlydata
monthlydata.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 62429 entries, 0 to 62428
Data columns (total 11 columns):
APMC               62429 non-null object
Commodity          62429 non-null object
Year               62429 non-null int64
Month              62429 non-null object
arrivals_in_qtl    62429 non-null int64
min_price          62429 non-null int64
max_price          62429 non-null int64
modal_price        62429 non-null int64
date               62429 non-null object
district_name      62429 non-null object
state_name         62429 non-null object
dtypes: int64(5), object(6)
memory usage: 5.2+ MB

In [13]:
# Fill the null values of most of the columns
monthlydata.isnull().sum()

APMC               0
Commodity          0
Year               0
Month              0
arrivals_in_qtl    0
min_price          0
max_price          0
modal_price        0
date               0
district_name      0
state_name         0
dtype: int64

In [14]:
# Check the values of last 5 rows of monthlydata
monthlydata.tail()

,APMC,Commodity,Year,Month,arrivals_in_qtl,min_price,max_price,modal_price,date,district_name,state_name
62424,Shrigonda,GRAM,2016,November,586,5700,6367,6200,2016-11,Ahmadnagar,Maharashtra
62425,Shrigonda,GREEN GRAM,2016,November,2,5000,5000,5000,2016-11,Ahmadnagar,Maharashtra
62426,Shrigonda,BLACK GRAM,2016,November,46,4700,6933,6400,2016-11,Ahmadnagar,Maharashtra
62427,Shrigonda,SOYBEAN,2016,November,166,2583,2708,2633,2016-11,Ahmadnagar,Maharashtra
62428,Shrigonda,SUNFLOWER,2016,November,74,2933,3200,3067,2016-11,Ahmadnagar,Maharashtra

In [15]:
# Export the new cleaned mspmandi csv file
mspmandi.to_csv('mspmandi.csv', index = False)

In [16]:
# Export the new cleaned monthlydata csv file 
monthlydata.to_csv('monthlydata.csv', index = False)

## Proceed to Exploratory Data Analysis!